; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v9 ?v5)
             (pred_4 ?v11 ?v10)
             (pred_3 ?v9 ?v10)
             (pred_12 ?v2 ?v9 )
	     (pred_5 ?v9)
             (pred_6 ?v3)
             (pred_10 ?v11)
             (pred_2 ?v10)
             (pred_8 ?v9)
             (pred_9 ?v11)
             (pred_7 ?v9)
             (pred_11 ))



(:action op_1
:parameters (?v8 ?v13 ?v7 ?v6)
:precondition (and (pred_6 ?v8) (pred_6 ?v13) (pred_10 ?v7) (pred_2 ?v6)
          (pred_1 ?v8 ?v13) (pred_4 ?v7 ?v6)
                   (pred_3 ?v13 ?v6) (pred_5 ?v8) 
                   (pred_8 ?v13) (pred_9 ?v7))
:effect (and  (pred_7 ?v13) (not (pred_8 ?v13))))


(:action op_4
:parameters (?v8 ?v1)
:precondition (and (pred_6 ?v8) (pred_6 ?v1)
               (pred_5 ?v8) (pred_1 ?v8 ?v1) (pred_7 ?v1))
:effect (and (pred_5 ?v1) (not (pred_5 ?v8))))

(:action op_2
:parameters (?v8 ?v7)
:precondition (and (pred_6 ?v8) (pred_10 ?v7) 
                  (pred_5 ?v8) (pred_12 ?v7 ?v8) (pred_11 ))
:effect (and (pred_9 ?v7)
   (not (pred_12 ?v7 ?v8)) (not (pred_11 ))))


(:action op_3
:parameters (?v8 ?v12 ?v4)
:precondition (and (pred_6 ?v8) (pred_10 ?v12) (pred_10 ?v4)
                  (pred_5 ?v8) (pred_9 ?v4) (pred_12 ?v12 ?v8))
:effect (and (pred_9 ?v12) (pred_12 ?v4 ?v8)
        (not (pred_9 ?v4)) (not (pred_12 ?v12 ?v8))))

(:action op_5
:parameters (?v8 ?v7)
:precondition (and (pred_6 ?v8) (pred_10 ?v7) 
                  (pred_5 ?v8) (pred_9 ?v7))
:effect (and (pred_11 ) (pred_12 ?v7 ?v8) (not (pred_9 ?v7)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_10 obj_15 obj_05 obj_09 obj_11 obj_04 obj_12 obj_27 obj_07 obj_17 obj_19 obj_02 obj_28 obj_20 obj_08 obj_21 obj_29 obj_30 obj_25 obj_01 obj_18 obj_23 obj_13 obj_06
    obj_22 obj_03
    obj_26 obj_24 obj_14
    )

    (:init
       (pred_11)

       (pred_6 obj_16)
       (pred_6 obj_10)
       (pred_6 obj_15)
       (pred_6 obj_05)
       (pred_6 obj_09)
       (pred_6 obj_11)
       (pred_6 obj_04)
       (pred_6 obj_12)
       (pred_6 obj_27)
       (pred_6 obj_07)
       (pred_6 obj_17)
       (pred_6 obj_19)
       (pred_6 obj_02)
       (pred_6 obj_28)
       (pred_6 obj_20)
       (pred_6 obj_08)
       (pred_6 obj_21)
       (pred_6 obj_29)
       (pred_6 obj_30)
       (pred_6 obj_25)
       (pred_6 obj_01)
       (pred_6 obj_18)
       (pred_6 obj_23)
       (pred_6 obj_13)
       (pred_6 obj_06)
       (pred_2 obj_22)
       (pred_2 obj_03)
       (pred_10 obj_26)
       (pred_10 obj_24)
       (pred_10 obj_14)

       (pred_1 obj_16 obj_11)
       (pred_1 obj_16 obj_10)
       (pred_1 obj_10 obj_04)
       (pred_1 obj_10 obj_15)
       (pred_1 obj_10 obj_16)
       (pred_1 obj_15 obj_12)
       (pred_1 obj_15 obj_05)
       (pred_1 obj_15 obj_10)
       (pred_1 obj_05 obj_27)
       (pred_1 obj_05 obj_09)
       (pred_1 obj_05 obj_15)
       (pred_1 obj_09 obj_07)
       (pred_1 obj_09 obj_05)
       (pred_1 obj_11 obj_17)
       (pred_1 obj_11 obj_04)
       (pred_1 obj_11 obj_16)
       (pred_1 obj_04 obj_19)
       (pred_1 obj_04 obj_12)
       (pred_1 obj_04 obj_10)
       (pred_1 obj_04 obj_11)
       (pred_1 obj_12 obj_02)
       (pred_1 obj_12 obj_27)
       (pred_1 obj_12 obj_15)
       (pred_1 obj_12 obj_04)
       (pred_1 obj_27 obj_28)
       (pred_1 obj_27 obj_07)
       (pred_1 obj_27 obj_05)
       (pred_1 obj_27 obj_12)
       (pred_1 obj_07 obj_20)
       (pred_1 obj_07 obj_09)
       (pred_1 obj_07 obj_27)
       (pred_1 obj_17 obj_08)
       (pred_1 obj_17 obj_19)
       (pred_1 obj_17 obj_11)
       (pred_1 obj_19 obj_21)
       (pred_1 obj_19 obj_02)
       (pred_1 obj_19 obj_04)
       (pred_1 obj_19 obj_17)
       (pred_1 obj_02 obj_29)
       (pred_1 obj_02 obj_28)
       (pred_1 obj_02 obj_12)
       (pred_1 obj_02 obj_19)
       (pred_1 obj_28 obj_30)
       (pred_1 obj_28 obj_20)
       (pred_1 obj_28 obj_27)
       (pred_1 obj_28 obj_02)
       (pred_1 obj_20 obj_25)
       (pred_1 obj_20 obj_07)
       (pred_1 obj_20 obj_28)
       (pred_1 obj_08 obj_01)
       (pred_1 obj_08 obj_21)
       (pred_1 obj_08 obj_17)
       (pred_1 obj_21 obj_18)
       (pred_1 obj_21 obj_29)
       (pred_1 obj_21 obj_19)
       (pred_1 obj_21 obj_08)
       (pred_1 obj_29 obj_23)
       (pred_1 obj_29 obj_30)
       (pred_1 obj_29 obj_02)
       (pred_1 obj_29 obj_21)
       (pred_1 obj_30 obj_13)
       (pred_1 obj_30 obj_25)
       (pred_1 obj_30 obj_28)
       (pred_1 obj_30 obj_29)
       (pred_1 obj_25 obj_06)
       (pred_1 obj_25 obj_20)
       (pred_1 obj_25 obj_30)
       (pred_1 obj_01 obj_18)
       (pred_1 obj_01 obj_08)
       (pred_1 obj_18 obj_23)
       (pred_1 obj_18 obj_21)
       (pred_1 obj_18 obj_01)
       (pred_1 obj_23 obj_13)
       (pred_1 obj_23 obj_29)
       (pred_1 obj_23 obj_18)
       (pred_1 obj_13 obj_06)
       (pred_1 obj_13 obj_30)
       (pred_1 obj_13 obj_23)
       (pred_1 obj_06 obj_25)
       (pred_1 obj_06 obj_13)
       (pred_8 obj_01)
       (pred_8 obj_25)
       (pred_8 obj_23)
       (pred_3  obj_01 obj_22)
       (pred_3  obj_25 obj_03)
       (pred_3  obj_23 obj_03)
       (pred_7 obj_16)
       (pred_7 obj_10)
       (pred_7 obj_15)
       (pred_7 obj_05)
       (pred_7 obj_09)
       (pred_7 obj_11)
       (pred_7 obj_04)
       (pred_7 obj_12)
       (pred_7 obj_27)
       (pred_7 obj_07)
       (pred_7 obj_17)
       (pred_7 obj_19)
       (pred_7 obj_02)
       (pred_7 obj_28)
       (pred_7 obj_20)
       (pred_7 obj_08)
       (pred_7 obj_21)
       (pred_7 obj_29)
       (pred_7 obj_30)
       (pred_7 obj_18)
       (pred_7 obj_13)
       (pred_7 obj_06)

       (pred_4  obj_26 obj_22)
       (pred_4  obj_24 obj_03)
       (pred_4  obj_14 obj_03)
       (pred_12 obj_26 obj_04)
       (pred_12 obj_24 obj_17)
       (pred_12 obj_14 obj_15)
       (pred_5 obj_07)
    )

    (:goal (and
       (pred_12 obj_26 obj_02)
       (pred_12 obj_24 obj_07)
    ))
(:constraints
  (always (not (pred_5 obj_12)))
)
)

; plan
1. (op_4 obj_07 obj_27)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_27)
   goals met: 0 of 2
2. (op_4 obj_27 obj_28)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_28)
   goals met: 0 of 2
3. (op_4 obj_28 obj_02)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_02)
   goals met: 0 of 2
4. (op_4 obj_02 obj_19)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_19)
   goals met: 0 of 2
5. (op_4 obj_19 obj_04)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_04)
   goals met: 0 of 2
6. (op_2 obj_04 obj_26)
   deleted: (pred_12 obj_26 obj_04) (pred_11)
   added: (pred_9 obj_26)
   goals met: 0 of 2
7. (op_4 obj_04 obj_19)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_19)
   goals met: 0 of 2
8. (op_4 obj_19 obj_02)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_02)
   goals met: 0 of 2
9. (op_5 obj_02 obj_26)
   deleted: (pred_9 obj_26)
   added: (pred_11) (pred_12 obj_26 obj_02)
   goals met: 1 of 2
10. (op_4 obj_02 obj_19)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_19)
   goals met: 1 of 2
11. (op_4 obj_19 obj_17)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_17)
   goals met: 1 of 2
12. (op_2 obj_17 obj_24)
   deleted: (pred_12 obj_24 obj_17) (pred_11)
   added: (pred_9 obj_24)
   goals met: 1 of 2
13. (op_4 obj_17 obj_19)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_19)
   goals met: 1 of 2
14. (op_4 obj_19 obj_02)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_02)
   goals met: 1 of 2
15. (op_4 obj_02 obj_28)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_28)
   goals met: 1 of 2
16. (op_4 obj_28 obj_27)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_27)
   goals met: 1 of 2
17. (op_4 obj_27 obj_07)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_07)
   goals met: 1 of 2
18. (op_5 obj_07 obj_24)
   deleted: (pred_9 obj_24)
   added: (pred_11) (pred_12 obj_24 obj_07)
   goals met: 2 of 2
